Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/scripting-omegat.tmx
Source language: en_us
Languages: pt_br

source: .sh files Editor Support
pt_br: Suporte ao editor de arquivos .sh

source: Languages Support
pt_br: Suporte à linguagens

source: Support for editing .sh files.
pt_br: Suporte para edição de arquivos .sh.

source: Sh File
pt_br: Arquivo sh

source: Line Comment
pt_br: Comentário de linha

source: Keyword
pt_br: Palavra-chave

source: Command
pt_br: Comando

source: Whitespace
pt_br: Espaço em branco

source: Number
pt_br: Número

source: Label
pt_br: Rótulo

source: Identifier
pt_br: Identificador

source: Operator
pt_br: Operador

source: Unexpected character.
pt_br: Caractere inesperado.

source: .bat Files Editor
pt_br: Editor de arquivos .bat

source: Support for .bat files editing.
pt_br: Suporte para edição de arquivos .bat.

source: Bat File
pt_br: Arquivo bat

source: Bat Files
pt_br: Arquivos bat

source: Error
pt_br: Erro

source: Creates empty JavaScript file.
pt_br: Cria arquivo JavaScript vazio.

source: You can edit the file in the IDE's Source Editor.
pt_br: O arquivo pode ser editado no editor de código-fonte do IDE.

source: And you can run it using the editor context menu.
pt_br: E executá-lo usando o menu de contexto do editor.

source: To change this template, choose Tools | Template Manager and open the template in the editor.
pt_br: Para mudar esse modelo, escolha Ferramentas | Gerenciador de modelos e abra o modelo no editor.

source: Creates empty JSON file.
pt_br: Cria arquivo JSON vazio.

source: JSON (JavaScript Object Notation) is a lightweight data-interchange format, subset of JavaScript.
pt_br: JSON (Notação de Objeto JavaScript) é um formato leve de intercâmbio de dados, subconjunto do JavaScript.

source: It is easy for humans to read and write, and widely used with Ajax applications.
pt_br: De fácil interpretação e edição por humanos, e amplamente utilizado em aplicativos Ajax.

source: JavaScript Editor Support
pt_br: Suporte ao editor de JavaScript

source: Support for editing JavaScript files.
pt_br: Suporte para edição de arquivos JavaScript.

source: JavaScript Files
pt_br: Arquivos JavaScript

source: JavaScript File
pt_br: Arquivo JavaScript

source: JSON File
pt_br: Arquivo JSON

source: Delete Current Method
pt_br: Excluir método atual

source: Run
pt_br: Executar

source: Expand Methods
pt_br: Expandir métodos

source: Collapse Methods
pt_br: Ocultar métodos

source: Expand Comments
pt_br: Expandir comentários

source: Collapse Comments
pt_br: Ocultar comentários

source: Expand Arrays
pt_br: Expandir arrays

source: Collapse Arrays
pt_br: Ocultar arrays

source: Expand Objects
pt_br: Expandir objetos

source: Collapse Objects
pt_br: Ocultar objetos

source: Syntax error.
pt_br: Erro de sintaxe.

source: JavaScript Strings
pt_br: Strings JavaScript

source: Parameter
pt_br: Parâmetro

source: Unused Parameter
pt_br: Não usar parâmetro

source: Local Variable
pt_br: Variável local

source: Unused Local Variable
pt_br: Não usar variável local

source: Method
pt_br: Método

source: Unused Method
pt_br: Não usar método

source: Comment
pt_br: Comentário

source: Regular Expression
pt_br: Expressão regular

source: Separator
pt_br: Separador

source: String Escape Sequence
pt_br: Seqüência string de escape
